OpenFOAM case folders/Double body/driftAngle6.00_rudderAngle6.0/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     transportProperties;;
}

	transportModel    Newtonian;
	nu                nu [ 0 2 -1 0 0 0 0 ]  1.140e-06;
