OpenFOAM case folders/Double body/driftAngle6.00_rudderAngle6.0/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     surfaceFeatureExtractDict;
}

ship.obj
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
				includedAngle   150;
				geometricTestOnly no;
    }

    subsetFeatures
    {
        nonManifoldEdges yes;
        openEdges        yes;
    }

    writeObj             no;
}

